2/index.html

<html>
<head>
    <title>Simple client SOAP en JavaScript</title>
    <script type="text/javascript">
        function soap() {
            const xmlhttp = new XMLHttpRequest();
            xmlhttp.open('POST', 'https://www.w3schools.com/xml/tempconvert.asmx', true);
            let form_celsius = document.getElementById('value').value;
            // Créer la requête SOAP
            let soap_request =
                '<?xml version="1.0" encoding="utf-8"?>' +
                '<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">' + 
                    '<soap12:Body>' +
                        '<CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/">' +
                            '<Celsius>'+ form_celsius +'</Celsius>' +
                        '</CelsiusToFahrenheit>' +
                    '</soap12:Body>' +
                '</soap12:Envelope>';
            xmlhttp.onreadystatechange = function () {
                if (xmlhttp.readyState == 4) {
                    if (xmlhttp.status == 200) {
                        console.log(xmlhttp.responseText)
                        result = document.getElementById('result')
                        result.innerHTML = xmlhttp.responseText
                    }
                }
            }
            // Requête en POST avec XML en type de contenu
            xmlhttp.setRequestHeader('Content-Type', 'text/xml; charset=utf-8');
            xmlhttp.send(soap_request);
        }
    </script>
</head>
<body>
    <form name="soap-client" action="" method="POST">
        <label for="value">Valeur en Celsius</label>
        <input type="text" name="value" id="value" />
        <br />
        <input type="button" value="Lancer la requête SOAP" onclick="soap();" />
    </form>
    <pre lang="xml" id="result"></pre>
</body>
</html>